In [1]:
import pandas as pd
alunos = pd.DataFrame({'Nome': ['Ary', 'Cátia', 'Denis', 'Beto', 'Bruna', 'Dara', 'Carlos', 'Alice'], 
                        'Sexo': ['M', 'F', 'M', 'M', 'F', 'F', 'M', 'F'], 
                        'Idade': [15, 27, 56, 32, 42, 21, 19, 35], 
                        'Notas': [7.5, 2.5, 5.0, 10, 8.2, 7, 6, 5.6]}, 
                        columns = ['Nome', 'Idade', 'Sexo', 'Notas'])
alunos

     Nome  Idade Sexo  Notas
0     Ary     15    M    7.5
1   Cátia     27    F    2.5
2   Denis     56    M    5.0
3    Beto     32    M   10.0
4   Bruna     42    F    8.2
5    Dara     21    F    7.0
6  Carlos     19    M    6.0
7   Alice     35    F    5.6

In [2]:
# Criando uma função para gerar um status de cada aluno
def add_obs(aluno):
    obs = aluno['Nome'] + ' teve a nota ' + str(aluno['Notas'])

    if aluno['Notas'] >= 7:
        obs = obs + ' e foi aprovado!'
    else:
        obs = obs + ' e foi reprovado!'

    return obs

# Aplicando a função acima para cada linha do dataframe
# axis=1 indica que queremos executar a função nas linhas
alunos.apply(add_obs, axis=1)

0        Ary teve a nota 7.5 e foi aprovado!
1     Cátia teve a nota 2.5 e foi reprovado!
2     Denis teve a nota 5.0 e foi reprovado!
3      Beto teve a nota 10.0 e foi aprovado!
4      Bruna teve a nota 8.2 e foi aprovado!
5       Dara teve a nota 7.0 e foi aprovado!
6    Carlos teve a nota 6.0 e foi reprovado!
7     Alice teve a nota 5.6 e foi reprovado!
dtype: object

In [3]:
s = pd.Series(list('asdadeadesdasesda'))
s

0     a
1     s
2     d
3     a
4     d
5     e
6     a
7     d
8     e
9     s
10    d
11    a
12    s
13    e
14    s
15    d
16    a
dtype: object

In [5]:
s.unique()

array(['a', 's', 'd', 'e'], dtype=object)

In [6]:
s.value_counts()

a    5
d    5
s    4
e    3
dtype: int64

In [10]:
dados = pd.read_csv("imoveis_residenciais.csv", sep=";")

In [11]:
dados.Tipo.value_counts()

Apartamento           19532
Casa de Condomínio      996
Casa                    967
Quitinete               836
Flat                    476
Casa de Vila            249
Loft                     51
Studio                    4
Name: Tipo, dtype: int64

In [23]:
m1 = 'CCcCCccCCCccCcCccCcCcCCCcCCcccCCcCcCcCcccCCcCcccCc'
m2 = 'CCCCCccCccCcCCCCccCccccCccCccCCcCccCcCcCCcCccCccCc'
m3 = 'CccCCccCcCCCCCCCCCCcccCccCCCCCCccCCCcccCCCcCCcccCC'
m4 = 'cCCccCCccCCccCCccccCcCcCcCcCcCcCCCCccccCCCcCCcCCCC'
m5 = 'CCCcCcCcCcCCCcCCcCcCCccCcCCcccCccCCcCcCcCcCcccccCc'

In [17]:
len(m1)

50

In [25]:
eventos = {'m1': list(m1), 
            'm2': list(m2), 
            'm3': list(m3), 
            'm4': list(m4), 
            'm5': list(m5)}
moedas = pd.DataFrame(eventos)
df = pd.DataFrame(data = ['Cara', 'Coroa'], 
                    index = ['c', 'C'], 
                    columns = ['Faces'])
for item in moedas:
    df = pd.concat([df, moedas[item].value_counts()], 
                    axis = 1)
df

   Faces  m1  m2  m3  m4  m5
c   Cara  25  26  19  23  25
C  Coroa  25  24  31  27  25